---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpatialElementBoundaryOptions
source: html/d1b2688f-718c-70cb-2cd4-6650aaa5f9aa.htm
---
# SpatialElementBoundaryOptions Members

Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).